<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"http","label":"production","backend":"f9ae04bb2e15fdcdfed914767569e697b1676b15d2508246d4bc3263251aa0b2","plan_job_ref":"Job Cloudflare Infra #6 at https://github.com/Just-Insane/Sable/actions/runs/23524279378","plan_out_hash":"9a706e3beed4086180d4977a5f9ed3fb804016fd9c0836d8a3b70188bc139e64","plan_hash":"cad5e843535fe2f89a32794d48a14295bcf75e5e859e9628fcd3ce6683f06e5d","plan_text_format":"diff","version":"2.2.3"} -->
OpenTofu plan for __production__
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy.</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

OpenTofu will perform the following actions:

  # cloudflare_worker_version.site must be replaced
-/+ resource "cloudflare_worker_version" "site" {
!~      annotations         = {
+           workers_message      = (known after apply)
+           workers_tag          = (known after apply)
!~          workers_triggered_by = "create_version_api" -> (known after apply)
        } -> (known after apply)
!~      assets              = { # forces replacement
!~          asset_manifest_sha256 = "941cb815465ce7006f178976d52f9a1c238e6ea836d07c672c7c50f69b55d529" -> "697946f4d0383eb4f5e3d246263a87b34ed4e535ee04e61e0f166079c836b0aa" # forces replacement
!~          directory             = "/home/runner/work/Sable/Sable/dist" -> "/github/workspace/dist"
#            (1 unchanged attribute hidden)
        }
+       compatibility_flags = (known after apply)
!~      created_on          = "2026-03-21T22:32:49Z" -> (known after apply)
!~      id                  = "************************************" -> (known after apply)
+       limits              = (known after apply)
+       main_script_base64  = (known after apply)
!~      number              = 9 -> (known after apply)
!~      source              = "terraform" -> (known after apply)
+       startup_time_ms     = (known after apply)
#        (4 unchanged attributes hidden)
    }

  # cloudflare_workers_deployment.site must be replaced
-/+ resource "cloudflare_workers_deployment" "site" {
!~      annotations  = { # forces replacement
!~          workers_message      = "92fe2adb7b5c3a5201dcc3ad3e9bb4b3f9d0430b" -> "Integration Branch (PR for viewing changes from `origin/dev` only)"
!~          workers_triggered_by = "deployment" -> (known after apply)
        }
+       author_email = (known after apply)
!~      created_on   = "2026-03-21T22:32:49Z" -> (known after apply)
!~      id           = "************************************" -> (known after apply)
!~      source       = "terraform" -> (known after apply)
!~      versions     = [ # forces replacement
!~          {
!~              version_id = "************************************" -> (known after apply)
#                (1 unchanged attribute hidden)
            },
        ]
#        (3 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Warning: Attribute Deprecated

  with cloudflare_workers_custom_domain.site,
  on main.tf line 41, in resource "cloudflare_workers_custom_domain" "site":
  41:   environment = "production"

This attribute is deprecated.

(and one more similar warning elsewhere)
```
</details>

:memo: Plan generated in [Cloudflare Infra #6](https://github.com/Just-Insane/Sable/actions/runs/23524279378)